#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2025z-318326/artifactregistry.googleapis.com]
data.google_client_config.provider: Reading...
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2025z-318326/global/networks/main-vpc]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2025z-318326-code]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2025z-318326-data]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2025z-318326"/regions/"europe-west1"/zones/<null>]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2025z-318326-code-spark-job.py]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2025z-318326/regions/europe-west1/subnetworks/subnet-01]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2025z-318326/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2025z-318326/regions/europe-west1/routers/nat-router]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2025z-318326/global/firewalls/allow-all-internal]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2025z-318326/global/firewalls/default-internal-allow-all]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2025z-318326/europe-west1/nat-router/nat-gateway]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2025z-318326/global/routes/egress-internet]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2025z-318326/dataproc.googleapis.com]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2025z-318326/composer.googleapis.com]
module.dataproc.google_storage_bucket.dataproc_temp: Refreshing state... [id=tbd-2025z-318326-dataproc-temp]
module.dataproc.google_storage_bucket.dataproc_staging: Refreshing state... [id=tbd-2025z-318326-dataproc-staging]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2025z-318326/serviceAccounts/tbd-2025z-318326-data@tbd-2025z-318326.iam.gserviceaccount.com]
module.dataproc.google_service_account.dataproc_sa: Refreshing state... [id=projects/tbd-2025z-318326/serviceAccounts/tbd-2025z-318326-dataproc-sa@tbd-2025z-318326.iam.gserviceaccount.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2025z-318326/regions/europe-west1/subnetworks/composer-subnet-01]
module.dataproc.google_project_iam_member.dataproc_bigquery_user: Refreshing state... [id=tbd-2025z-318326/roles/bigquery.user/serviceAccount:tbd-2025z-318326-dataproc-sa@tbd-2025z-318326.iam.gserviceaccount.com]
module.dataproc.google_project_iam_member.dataproc_worker: Refreshing state... [id=tbd-2025z-318326/roles/dataproc.worker/serviceAccount:tbd-2025z-318326-dataproc-sa@tbd-2025z-318326.iam.gserviceaccount.com]
module.dataproc.google_project_iam_member.dataproc_bigquery_data_editor: Refreshing state... [id=tbd-2025z-318326/roles/bigquery.dataEditor/serviceAccount:tbd-2025z-318326-dataproc-sa@tbd-2025z-318326.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket_iam_member.staging_bucket_iam: Refreshing state... [id=b/tbd-2025z-318326-dataproc-staging/roles/storage.objectAdmin/serviceAccount:tbd-2025z-318326-dataproc-sa@tbd-2025z-318326.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2025z-318326/roles/iam.serviceAccountUser/serviceAccount:tbd-2025z-318326-data@tbd-2025z-318326.iam.gserviceaccount.com]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2025z-318326/roles/composer.worker/serviceAccount:tbd-2025z-318326-data@tbd-2025z-318326.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2025z-318326/roles/dataproc.editor/serviceAccount:tbd-2025z-318326-data@tbd-2025z-318326.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2025z-318326-code/roles/storage.objectViewer/serviceAccount:tbd-2025z-318326-data@tbd-2025z-318326.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2025z-318326-data/roles/storage.objectUser/serviceAccount:tbd-2025z-318326-data@tbd-2025z-318326.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket_iam_member.temp_bucket_iam: Refreshing state... [id=b/tbd-2025z-318326-dataproc-temp/roles/storage.objectAdmin/serviceAccount:tbd-2025z-318326-dataproc-sa@tbd-2025z-318326.iam.gserviceaccount.com]
module.composer.module.composer.data.google_project.project: Reading...
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2025z-318326/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2025z-318326/regions/europe-west1/clusters/tbd-cluster]
module.composer.module.composer.data.google_project.project: Read complete after 0s [id=projects/tbd-2025z-318326]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2025z-318326/roles/composer.ServiceAgentV2Ext/serviceAccount:service-1094786992778@cloudcomposer-accounts.iam.gserviceaccount.com]
module.composer.module.composer.google_composer_environment.composer_env: Refreshing state... [id=projects/tbd-2025z-318326/locations/europe-west1/environments/demo-lab]
module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-ffc034cc-bucket-dags/data-dag.py]
data.google_container_cluster.composer-gke-cluster: Reading...
module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-ffc034cc-bucket-dags/dbt-dag.py]
module.dbt_docker_image.docker_image.dbt: Refreshing state... [id=sha256:377a85774a69c3ce16c582cf305c03d002d5d2be9de5a022b901562260a9e6b2eu.gcr.io/tbd-2025z-318326/dbt:1.8.7]
module.dbt_docker_image.docker_registry_image.dbt: Refreshing state... [id=sha256:bfb30eec2b7b0446f9d5cfffe2525d4ba5bf8a114b24c327e16e6d2b1e005e3f]
data.google_container_cluster.composer-gke-cluster: Still reading... [10s elapsed]
data.google_container_cluster.composer-gke-cluster: Still reading... [20s elapsed]
data.google_container_cluster.composer-gke-cluster: Read complete after 24s [id=projects/tbd-2025z-318326/locations/europe-west1/clusters/europe-west1-demo-lab-ffc034cc-gke]
kubernetes_service.dbt-task-service: Refreshing state... [id=composer-user-workloads/dbt-task-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.dbt_docker_image.docker_image.dbt has been deleted
  - resource "docker_image" "dbt" {
        id          = "sha256:377a85774a69c3ce16c582cf305c03d002d5d2be9de5a022b901562260a9e6b2eu.gcr.io/tbd-2025z-318326/dbt:1.8.7"
      - name        = "eu.gcr.io/tbd-2025z-318326/dbt:1.8.7" -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster must be replaced
-/+ resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
      ~ effective_labels              = {
          - "goog-dataproc-autozone"          = "enabled"
          - "goog-dataproc-cluster-name"      = "tbd-cluster"
          - "goog-dataproc-cluster-uuid"      = "62ed7b37-47b4-4659-a5c2-eedfe787d480"
          - "goog-dataproc-drz-resource-uuid" = "cluster-62ed7b37-47b4-4659-a5c2-eedfe787d480"
          - "goog-dataproc-location"          = "europe-west1"
        } -> (known after apply)
      ~ id                            = "projects/tbd-2025z-318326/regions/europe-west1/clusters/tbd-cluster" -> (known after apply)
      - labels                        = {} -> null
        name                          = "tbd-cluster"
      ~ terraform_labels              = {} -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ cluster_config {
          ~ bucket         = "tbd-2025z-318326-dataproc-staging" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ auxiliary_node_groups (known after apply)

          ~ dataproc_metric_config (known after apply)

          ~ endpoint_config {
              ~ http_ports              = {
                  - "HDFS NameNode"             = "https://x7z37d32svgodnurmsfhnpgkfe-dot-europe-west1.dataproc.googleusercontent.com/hdfs/dfshealth.html"
                  - "Jupyter"                   = "https://x7z37d32svgodnurmsfhnpgkfe-dot-europe-west1.dataproc.googleusercontent.com/gateway/default/jupyter/"
                  - "JupyterLab"                = "https://x7z37d32svgodnurmsfhnpgkfe-dot-europe-west1.dataproc.googleusercontent.com/gateway/default/jupyter/lab/"
                  - "MapReduce Job History"     = "https://x7z37d32svgodnurmsfhnpgkfe-dot-europe-west1.dataproc.googleusercontent.com/jobhistory/"
                  - "Spark History Server"      = "https://x7z37d32svgodnurmsfhnpgkfe-dot-europe-west1.dataproc.googleusercontent.com/sparkhistory/"
                  - "Tez"                       = "https://x7z37d32svgodnurmsfhnpgkfe-dot-europe-west1.dataproc.googleusercontent.com/apphistory/tez-ui/"
                  - "YARN Application Timeline" = "https://x7z37d32svgodnurmsfhnpgkfe-dot-europe-west1.dataproc.googleusercontent.com/apphistory/"
                  - "YARN ResourceManager"      = "https://x7z37d32svgodnurmsfhnpgkfe-dot-europe-west1.dataproc.googleusercontent.com/yarn/"
                } -> (known after apply)
                # (1 unchanged attribute hidden)
            }

          ~ gce_cluster_config {
              + network                = (known after apply)
              ~ service_account_scopes = [
                  - "https://www.googleapis.com/auth/cloud.useraccounts.readonly",
                  - "https://www.googleapis.com/auth/devstorage.read_write",
                  - "https://www.googleapis.com/auth/logging.write",
                    # (1 unchanged element hidden)
                ]
              ~ subnetwork             = "https://www.googleapis.com/compute/v1/projects/tbd-2025z-318326/regions/europe-west1/subnetworks/subnet-01" -> "projects/tbd-2025z-318326/regions/europe-west1/subnetworks/subnet-01"
              - tags                   = [] -> null
              ~ zone                   = "europe-west1-d" -> (known after apply)
                # (3 unchanged attributes hidden)

              ~ node_group_affinity (known after apply)

              ~ reservation_affinity (known after apply)

              ~ shielded_instance_config (known after apply)
              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = true -> null
                  - enable_vtpm                 = true -> null
                }
            }

          ~ master_config {
              ~ image_uri        = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-2-ubu22-20251016-165100-rc01" -> (known after apply)
              ~ instance_names   = [
                  - "tbd-cluster-m",
                ] -> (known after apply)
              ~ min_cpu_platform = "AUTOMATIC" -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ disk_config {
                  ~ num_local_ssds      = 0 -> (known after apply)
                    # (3 unchanged attributes hidden)
                }
            }

          ~ preemptible_worker_config {
              ~ instance_names = [] -> (known after apply)
              ~ num_instances  = 0 -> 3
              + preemptibility = "SPOT" # forces replacement

              ~ disk_config {
                  + boot_disk_size_gb = 100 # forces replacement
                  + boot_disk_type    = "pd-standard" # forces replacement
                  + num_local_ssds    = (known after apply)
                }

              ~ instance_flexibility_policy {
                  ~ instance_selection_results = [] -> (known after apply)

                  + instance_selection_list { # forces replacement
                      + machine_types = [ # forces replacement
                          + "e2-standard-2",
                        ]
                      + rank          = 1 # forces replacement
                    }
                }
            }

          ~ software_config {
              - override_properties = {} -> null
              ~ properties          = {
                  - "capacity-scheduler:yarn.scheduler.capacity.resource-calculator"                          = "org.apache.hadoop.yarn.util.resource.DominantResourceCalculator"
                  - "capacity-scheduler:yarn.scheduler.capacity.root.default.ordering-policy"                 = "fair"
                  - "core:fs.gs.block.size"                                                                   = "134217728"
                  - "core:fs.gs.metadata.cache.enable"                                                        = "false"
                  - "core:hadoop.ssl.enabled.protocols"                                                       = "TLSv1,TLSv1.1,TLSv1.2"
                  - "distcp:mapreduce.map.java.opts"                                                          = "-Xmx576m"
                  - "distcp:mapreduce.map.memory.mb"                                                          = "768"
                  - "distcp:mapreduce.reduce.java.opts"                                                       = "-Xmx576m"
                  - "distcp:mapreduce.reduce.memory.mb"                                                       = "768"
                  - "hadoop-env:HADOOP_DATANODE_OPTS"                                                         = "-Xmx512m"
                  - "hdfs:dfs.datanode.address"                                                               = "0.0.0.0:9866"
                  - "hdfs:dfs.datanode.http.address"                                                          = "0.0.0.0:9864"
                  - "hdfs:dfs.datanode.https.address"                                                         = "0.0.0.0:9865"
                  - "hdfs:dfs.datanode.ipc.address"                                                           = "0.0.0.0:9867"
                  - "hdfs:dfs.namenode.handler.count"                                                         = "20"
                  - "hdfs:dfs.namenode.http-address"                                                          = "0.0.0.0:9870"
                  - "hdfs:dfs.namenode.https-address"                                                         = "0.0.0.0:9871"
                  - "hdfs:dfs.namenode.lifeline.rpc-address"                                                  = "tbd-cluster-m:8050"
                  - "hdfs:dfs.namenode.secondary.http-address"                                                = "0.0.0.0:9868"
                  - "hdfs:dfs.namenode.secondary.https-address"                                               = "0.0.0.0:9869"
                  - "hdfs:dfs.namenode.service.handler.count"                                                 = "10"
                  - "hdfs:dfs.namenode.servicerpc-address"                                                    = "tbd-cluster-m:8051"
                  - "mapred-env:HADOOP_JOB_HISTORYSERVER_HEAPSIZE"                                            = "2048"
                  - "mapred:mapreduce.job.maps"                                                               = "9"
                  - "mapred:mapreduce.job.reduce.slowstart.completedmaps"                                     = "0.95"
                  - "mapred:mapreduce.job.reduces"                                                            = "3"
                  - "mapred:mapreduce.jobhistory.recovery.store.class"                                        = "org.apache.hadoop.mapreduce.v2.hs.HistoryServerLeveldbStateStoreService"
                  - "mapred:mapreduce.map.cpu.vcores"                                                         = "1"
                  - "mapred:mapreduce.map.java.opts"                                                          = "-Xmx2621m"
                  - "mapred:mapreduce.map.memory.mb"                                                          = "3277"
                  - "mapred:mapreduce.reduce.cpu.vcores"                                                      = "1"
                  - "mapred:mapreduce.reduce.java.opts"                                                       = "-Xmx2621m"
                  - "mapred:mapreduce.reduce.memory.mb"                                                       = "3277"
                  - "mapred:mapreduce.task.io.sort.mb"                                                        = "256"
                  - "mapred:yarn.app.mapreduce.am.command-opts"                                               = "-Xmx2621m"
                  - "mapred:yarn.app.mapreduce.am.resource.cpu-vcores"                                        = "1"
                  - "mapred:yarn.app.mapreduce.am.resource.mb"                                                = "3277"
                  - "spark-env:SPARK_DAEMON_MEMORY"                                                           = "2048m"
                  - "spark:spark.driver.maxResultSize"                                                        = "1024m"
                  - "spark:spark.driver.memory"                                                               = "2048m"
                  - "spark:spark.executor.cores"                                                              = "1"
                  - "spark:spark.executor.instances"                                                          = "2"
                  - "spark:spark.executor.memory"                                                             = "2893m"
                  - "spark:spark.executorEnv.OPENBLAS_NUM_THREADS"                                            = "1"
                  - "spark:spark.plugins.defaultList"                                                         = "com.google.cloud.dataproc.DataprocSparkPlugin"
                  - "spark:spark.scheduler.mode"                                                              = "FAIR"
                  - "spark:spark.sql.cbo.enabled"                                                             = "true"
                  - "spark:spark.sql.optimizer.runtime.bloomFilter.join.pattern.enabled"                      = "true"
                  - "spark:spark.ui.port"                                                                     = "0"
                  - "spark:spark.yarn.am.memory"                                                              = "640m"
                  - "yarn-env:YARN_NODEMANAGER_HEAPSIZE"                                                      = "819"
                  - "yarn-env:YARN_RESOURCEMANAGER_HEAPSIZE"                                                  = "2048"
                  - "yarn-env:YARN_TIMELINESERVER_HEAPSIZE"                                                   = "2048"
                  - "yarn:yarn.nodemanager.address"                                                           = "0.0.0.0:8026"
                  - "yarn:yarn.nodemanager.resource.cpu-vcores"                                               = "2"
                  - "yarn:yarn.nodemanager.resource.memory-mb"                                                = "6554"
                  - "yarn:yarn.resourcemanager.decommissioning-nodes-watcher.decommission-if-no-shuffle-data" = "true"
                  - "yarn:yarn.resourcemanager.nodemanager-graceful-decommission-timeout-secs"                = "86400"
                  - "yarn:yarn.scheduler.maximum-allocation-mb"                                               = "6554"
                  - "yarn:yarn.scheduler.minimum-allocation-mb"                                               = "1"
                } -> (known after apply)
                # (2 unchanged attributes hidden)
            }

          ~ worker_config {
              ~ image_uri         = "https://www.googleapis.com/compute/v1/projects/cloud-dataproc/global/images/dataproc-2-2-ubu22-20251016-165100-rc01" -> (known after apply)
              ~ instance_names    = [
                  - "tbd-cluster-w-0",
                  - "tbd-cluster-w-1",
                ] -> (known after apply)
              ~ min_cpu_platform  = "AUTOMATIC" -> (known after apply)
              ~ min_num_instances = 0 -> (known after apply)
                # (2 unchanged attributes hidden)

              ~ disk_config {
                  ~ num_local_ssds      = 0 -> (known after apply)
                    # (3 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ virtual_cluster_config (known after apply)
    }

  # module.dbt_docker_image.docker_image.dbt will be created
  + resource "docker_image" "dbt" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2025z-318326/dbt:1.8.7"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "16d9a47a192d8b357f5d8b2ba5b77c3a61503388"
        }

      + build {
          + build_args     = {
              + "DBT_SPARK_VERSION" = "1.8.0"
              + "DBT_VERSION"       = "1.8.7"
              + "PROJECT_NAME"      = "tbd-2025z-318326"
              + "SPARK_VERSION"     = "3.5.1"
            }
          + cache_from     = []
          + context        = "modules/dbt_docker_image/resources"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "amd64"
          + remove         = true
          + security_opt   = []
          + tag            = [
              + "eu.gcr.io/tbd-2025z-318326/dbt:latest",
            ]
            # (10 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named
"ai_notebook_instance_owner" but a value was found in file
"env/project.tfvars". If you meant to use this value, add a "variable" block
to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @xcomerni, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*